{
    "modules": [
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Tools\\WebmasterTools",
            "file": "Tools/WebmasterTools.php",
            "title": "Search Console Integration",
            "description": "Integrates with Google Search Console and Bing Webmaster Tools to verify website ownership and access performance data and diagnostic information.",
            "explain": "After a user enters their Google Search Console and Bing Webmaster Tools verification codes in the settings, this module automatically adds the necessary meta tags to the site\\'s header. This verifies website ownership, allowing access to valuable data in both search consoles.  With automatic submission enabled, this module also submits the generated sitemap to both search engines, ensuring quick indexing of new content.",
            "version": "1.0.0",
            "name": "webmasterTools",
            "priority": 28,
            "dependencies": "[]",
            "settings": "[['key' => 'google_verification_code', 'type' => 'string', 'default' => '', 'description' => 'Your Google Search Console verification code. This code is used to prove ownership of your website.'], ['key' => 'bing_verification_code', 'type' => 'string', 'default' => '', 'description' => 'Your Bing Webmaster Tools verification code. This code is used to prove ownership of your website with Bing.'], ['key' => 'automatic_submission', 'type' => 'boolean', 'default' => True, 'description' => 'Automatically submit updated sitemaps to Google and Bing upon generation.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Tools\\SEOAudit",
            "file": "Tools/SEOAudit.php",
            "title": "SEO Audit Tool",
            "description": "Performs comprehensive SEO audits, analyzing various aspects of website performance, including technical SEO, content quality, meta tags, page speed, and more. Provides actionable recommendations for site improvement and tracks progress over time.",
            "explain": "The SEO Audit Tool performs a monthly audit (based on the default setting), analyzing meta tags, page speed, content quality (using data from the \\'Content Analysis\\' module), and technical SEO aspects.  The audit report highlights areas for improvement, such as missing meta descriptions, slow-loading pages, or broken links. The report is displayed in the plugin\\'s dashboard and, if email notifications are enabled, a summary is sent to the site administrator.  The tool also tracks SEO progress over time, allowing users to see the impact of their optimization efforts.",
            "version": "1.0.0",
            "name": "seoAudit",
            "priority": 20,
            "dependencies": "[]",
            "settings": "[['key' => 'audit_frequency', 'type' => 'string', 'default' => 'monthly', 'description' => 'How often automated SEO audits are performed: \\'weekly\\', \\'monthly\\', or \\'quarterly\\'.'], ['key' => 'include_technical_seo', 'type' => 'boolean', 'default' => True, 'description' => 'Include technical SEO checks in the audit, such as sitemap presence, robots.txt validation, and HTTPS configuration.'], ['key' => 'email_notifications', 'type' => 'boolean', 'default' => True, 'description' => 'Send email notifications to the administrator with a summary of the SEO audit report.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Tools\\CompetitorAnalysis",
            "file": "Tools/CompetitorAnalysis.php",
            "title": "Competitor SEO Analysis",
            "description": "Analyzes competitor websites to provide insights into their SEO strategies, including keyword rankings, backlink profiles, content performance, and other key metrics. Helps identify opportunities to improve your own SEO strategy and outperform competitors.",
            "explain": "A user enters the URLs of their main competitors into the module settings. The Competitor SEO Analysis module then analyzes these websites weekly (based on the configured analysis frequency), tracking their rankings for the specified focus keywords (or using the keywords from \\'Keyword Rank Tracker\\'). The module generates reports showing competitor keyword rankings, backlink profiles, and content performance. These insights help users understand competitor strategies, identify opportunities to improve their own SEO, and gain a competitive edge in search results.",
            "version": "1.0.0",
            "name": "competitorAnalysis",
            "priority": 21,
            "dependencies": "[]",
            "settings": "[['key' => 'competitor_websites', 'type' => 'array', 'default' => [], 'description' => 'A list of competitor website URLs to track (e.g., [\\'https://competitor1.com\\', \\'https://competitor2.com\\']). Separate URLs with commas.'], ['key' => 'analysis_frequency', 'type' => 'string', 'default' => 'weekly', 'description' => 'How often to perform competitor analysis: \\'weekly\\', \\'bi-weekly\\', or \\'monthly\\'.'], ['key' => 'focus_keywords', 'type' => 'array', 'default' => [], 'description' => 'A list of focus keywords to analyze competitor performance against (e.g., [\\'SEO\\', \\'WordPress\\']).  Leave blank to use the target keywords from the Keyword Rank Tracker.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Core\\RankingCoachDashboard\\RankingCoachDashboard",
            "file": "Core/RankingCoachDashboard/RankingCoachDashboard.php",
            "title": "RankingCoach Dashboard",
            "description": "The central module that coordinates and manages all other Ranking Coach modules. Provides the main interface and reporting dashboard for SEO analysis and recommendations.",
            "explain": "The Dashboard module collects data from all other active modules, such as keyword rankings from \\'Text Optimizer\\', sitemap status from \\'Sitemap,\\' and webmaster tools verification from \\'Webmaster Tools.\\'  It then presents this information in a unified dashboard, providing an overview of the website\\'s SEO performance and offering actionable recommendations. The dashboard reporting frequency setting controls how often new reports are generated.",
            "version": "2.0.0",
            "name": "rankingcoachDashboard",
            "priority": 100,
            "dependencies": "[]",
            "settings": "[\n\t\t\t\t['key' => 'dashboard_reporting_frequency', 'type' => 'string', 'default' => 'weekly', 'description' => 'How often SEO reports and summaries are generated on the dashboard: \\'daily\\', \\'weekly\\', or \\'monthly\\'.']\n            ]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\WordPress\\SpecializedPluginIntegrations",
            "file": "WordPress/SpecializedPluginIntegrations.php",
            "title": "Specialized Plugin Integrations",
            "description": "Provides tailored integrations with specific, popular non-SEO plugins to enhance their functionalities with SEO data and optimizations.",
            "explain": "This module might integrate with WooCommerce to automatically add product schema markup to product pages, optimize product descriptions for targeted keywords (pulled from `window.rankingCoach`), and track product page performance in search results. It could also connect with Contact Form 7 to add tracking parameters to form URLs, allowing for analysis of form submission sources and conversion rates. Integration with other plugins like page builders (e.g., Elementor) could provide SEO analysis and recommendations within the page builder interface itself.",
            "version": "1.0.0",
            "name": "specializedPluginIntegrations",
            "priority": 2,
            "dependencies": "[]",
            "settings": "[['key' => 'woocommerce_integration_enabled', 'type' => 'boolean', 'default' => True, 'description' => 'Enable integration with WooCommerce.'], ['key' => 'contact_form_7_integration_enabled', 'type' => 'boolean', 'default' => false, 'description' => 'Enable integration with Contact Form 7.'], ['key' => 'elementor_integration_enabled', 'type' => 'boolean', 'default' => false, 'description' => 'Enable integration with Elementor.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Content\\ContentAnalysis",
            "file": "Content/ContentAnalysis.php",
            "title": "SEO Content Analysis",
            "description": "Performs in-depth analysis of content to assess SEO performance, focusing on keyword density, readability, content length, and other relevant factors. Provides actionable recommendations for content improvement.",
            "explain": "After a user finishes writing a blog post, this module analyzes the content.  It checks the keyword density based on the target keywords identified by the \\'Text Optimizer\\' module, assesses the readability level using metrics like Flesch-Kincaid score, and evaluates content length. If the keyword density is too high (potential keyword stuffing), the module provides a warning and suggests reducing keyword usage.  If the readability is poor, it might suggest shorter sentences and simpler vocabulary.  The module also checks if the content meets the minimum recommended length and suggests adding more content if it\\'s too short.",
            "version": "1.0.0",
            "name": "contentAnalysis",
            "priority": 13,
            "dependencies": "[]",
            "settings": "[['key' => 'check_keyword_density', 'type' => 'boolean', 'default' => True, 'description' => 'Analyze keyword density to ensure optimal keyword usage and avoid keyword stuffing.'], ['key' => 'check_readability', 'type' => 'boolean', 'default' => True, 'description' => 'Analyze content readability to assess its complexity and suggest improvements for better user engagement.'], ['key' => 'min_content_length', 'type' => 'integer', 'default' => 300, 'description' => 'Minimum recommended content length (in words).  Content shorter than this might be flagged for improvement.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Content\\ContentDuplicationChecker",
            "file": "Content/ContentDuplicationChecker.php",
            "title": "Content Duplication Checker",
            "description": "Identifies and helps resolve duplicate content issues within your website and optionally across the web to improve SEO performance.",
            "explain": "The Content Duplication Checker scans your website for duplicate content. It highlights sections of text that are identical or very similar to other content on your site.  You can then review the flagged content and make necessary revisions to avoid SEO penalties.",
            "version": "1.0.0",
            "name": "contentDuplicationChecker",
            "priority": 11,
            "dependencies": "[]",
            "settings": "[['key' => 'check_internal_duplicates', 'type' => 'boolean', 'default' => true, 'description' => 'Check for duplicate content within your own website.'], ['key' => 'check_external_duplicates', 'type' => 'boolean', 'default' => false, 'description' => 'Check for duplicate content across the web (may require an external service).'], ['key' => 'sensitivity_level', 'type' => 'string', 'default' => 'medium', 'description' => 'Set the sensitivity level for duplicate content detection (e.g., \"low\", \"medium\", \"high\").']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Content\\ContentScheduler",
            "file": "Content/ContentScheduler.php",
            "title": "Content Update Scheduler",
            "description": "Allows users to schedule content updates and revisions, helping maintain content freshness and improve SEO performance over time. Integrates with the Content Analysis module to track the impact of updates on SEO metrics.",
            "explain": "A user schedules a blog post to be reviewed and updated every month. The Content Update Scheduler sends a reminder email one week before the scheduled update date. After the post is updated, the \\'Content Analysis\\' module automatically analyzes the revised content, tracking changes in keyword density, readability, and other SEO metrics.  This helps users understand the impact of content updates on their SEO performance and refine their content strategy over time.",
            "version": "1.0.0",
            "name": "contentScheduler",
            "priority": 17,
            "dependencies": "[]",
            "settings": "[['key' => 'enable_scheduled_updates', 'type' => 'boolean', 'default' => True, 'description' => 'Enable the content scheduling feature. When enabled, you can schedule updates for individual posts and pages.'], ['key' => 'default_update_interval', 'type' => 'string', 'default' => 'weekly', 'description' => 'The default time interval between scheduled content updates: \\'daily\\', \\'weekly\\', \\'monthly\\', or \\'yearly\\'.'], ['key' => 'send_update_reminders', 'type' => 'boolean', 'default' => True, 'description' => 'Send email reminders to content authors or administrators when a scheduled update is due.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Content\\TextOptimizer",
            "file": "Content/TextOptimizer.php",
            "title": "Content Optimizer",
            "description": "Analyzes and optimizes content for SEO by evaluating keyword density, readability, and other relevant factors. Provides suggestions for improving content quality and search engine ranking.",
            "explain": "A user writes a blog post about \\'SEO tips for WordPress.\\'  The Content Optimizer module analyzes the post\\'s content, checking the density of the target keywords (\\'SEO,\\' \\'WordPress\\') specified in the settings.  It also assesses the readability level and suggests improvements like simplifying sentence structure or using more headings.  If the post is shorter than the configured minimum word count (e.g., 300 words), the module might provide a warning or suggest expanding the content for more thorough analysis.",
            "version": "1.0.0",
            "name": "textOptimizer",
            "priority": 4,
            "dependencies": "[]",
            "settings": "[['key' => 'target_keywords', 'type' => 'array', 'default' => [], 'description' => 'An array of primary keywords to target for content optimization (e.g., [\\'SEO\\', \\'WordPress\\', \\'content marketing\\']). Separate keywords with commas.'], ['key' => 'enable_readability_analysis', 'type' => 'boolean', 'default' => True, 'description' => 'Enable readability analysis to assess content complexity and suggest improvements for better user engagement.'], ['key' => 'min_word_count', 'type' => 'integer', 'default' => 300, 'description' => 'Minimum word count for content analysis to be performed.  Shorter content might not provide sufficient data for accurate analysis.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Local\\LocalSEOOptimizer",
            "file": "Local/LocalSEOOptimizer.php",
            "title": "Local SEO Optimizer",
            "description": "Optimizes websites for local search visibility by adding LocalBusiness schema markup, managing location-based keywords, and integrating with location-based services. Helps businesses rank higher in local search results.",
            "explain": "For a bakery in San Francisco, the module adds LocalBusiness schema to the website, including the bakery\\'s name, address, phone number, and hours of operation. This structured data helps search engines understand that this is a local business and increases visibility in local search results (e.g., when someone searches for \\'bakery in San Francisco\\'). The module can also integrate with Google Maps or other location services to display the business location on the website, improving user engagement.",
            "version": "1.0.0",
            "name": "localSeoOptimizer",
            "priority": 16,
            "dependencies": "[]",
            "settings": "[['key' => 'enable_local_business_schema', 'type' => 'boolean', 'default' => True, 'description' => 'Enable LocalBusiness schema markup to provide search engines with detailed information about your business, including name, address, phone number, and operating hours.'], ['key' => 'business_name', 'type' => 'string', 'default' => '', 'description' => 'The name of your local business. This should match the name used on your Google My Business profile (if you have one).'], ['key' => 'business_address', 'type' => 'string', 'default' => '', 'description' => 'The full street address of your business location.'], ['key' => 'business_phone', 'type' => 'string', 'default' => '', 'description' => 'The primary phone number for your business.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Local\\LocalSEOEnhancements",
            "file": "Local/LocalSEOEnhancements.php",
            "title": "Local SEO Enhancements (Google My Business Integration)",
            "description": "Connect and manage your Google My Business profile directly from your WordPress dashboard to enhance your local SEO presence.",
            "explain": "Connect your Google My Business account to manage your business information, posts, reviews, and other GMB features directly within WordPress.  This integration streamlines your local SEO efforts and helps you maintain consistent and accurate business information across platforms.",
            "version": "1.0.0",
            "name": "localSeoGmb",
            "priority": 16,
            "dependencies": "[]",
            "settings": "[['key' => 'gmb_api_key', 'type' => 'string', 'default' => '', 'description' => 'Enter your Google My Business API key to connect your account.'], ['key' => 'gmb_location_id', 'type' => 'string', 'default' => '', 'description' => 'Enter your Google My Business location ID.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Schema\\HreflangTagsInternational",
            "file": "Schema/HreflangTagsInternational.php",
            "title": "International SEO (Hreflang Tags)",
            "description": "Manage hreflang tags and other locale-specific settings to optimize your website for international audiences and improve search visibility in different regions.",
            "explain": "For websites targeting multiple languages and regions, this module helps manage hreflang tags. Specify the languages and corresponding URLs for different versions of your website, and the module automatically generates the correct hreflang tags to signal to search engines which version to display to users in specific locations.",
            "version": "1.0.0",
            "name": "internationalSeo",
            "priority": 15,
            "dependencies": "[]",
            "settings": "[['key' => 'default_language', 'type' => 'string', 'default' => 'en', 'description' => 'Set the default language for your website (e.g., \"en\", \"es\", \"fr\").'], ['key' => 'supported_languages', 'type' => 'array', 'default' => [], 'description' => 'Add an array of supported languages and their corresponding URLs (e.g., [[\"language\" => \"es\", \"url\" => \"https://example.com/es\"], [\"language\" => \"fr\", \"url\" => \"https://example.com/fr\"]]).']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Schema\\SchemaMarkup\\SchemaMarkup",
            "file": "Schema/SchemaMarkup/SchemaMarkup.php",
            "title": "Structured Data Markup",
            "description": "Adds structured data markup (using schema.org vocabulary) to pages and posts, enhancing SEO visibility by providing search engines with more context about the content. Supports various schema types, configurable through settings.",
            "explain": "For a blog post, this module adds JSON-LD structured data markup based on the Article schema. This markup includes the post title, author, publication date, and other relevant information, helping search engines understand the context of the post.  If the \\'enable_product_schema\\' setting is enabled, and it detects WooCommerce product data, it adds Product schema markup to product pages, including price and availability. For pages that don\\'t have a specific schema assigned, it uses the default schema type (e.g., \\'WebPage\\') specified in the settings.",
            "version": "1.0.0",
            "name": "schemaMarkup",
            "priority": 12,
            "dependencies": "[]",
            "settings": "[['key' => 'enable_article_schema', 'type' => 'boolean', 'default' => True, 'description' => 'Enable schema markup for articles and blog posts, providing information about author, publishing date, and other relevant details.'], ['key' => 'enable_product_schema', 'type' => 'boolean', 'default' => False, 'description' => 'Enable schema markup for product pages, including details like price, availability, and reviews.'], ['key' => 'default_schema_type', 'type' => 'string', 'default' => 'Article', 'description' => 'The default schema type to use for pages that don\\'t have a specific schema type assigned. Options: \\'Article\\', \\'WebPage\\', etc. (See documentation for a full list).']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Social\\SocialMedia",
            "file": "Social/SocialMedia.php",
            "title": "Social Media Integration",
            "description": "Enhances social media sharing and visibility by integrating social media meta tags (Open Graph, Twitter Cards, etc.) into pages and posts.  Allows customization of meta data for different platforms.",
            "explain": "When a user shares a blog post on Facebook, this module ensures that a rich preview is displayed, including the post title, description, featured image, and website URL, pulled from the meta tags generated by this module using the data and settings from the \\'Meta Tags\\' module.  Similarly, when shared on Twitter, the module generates appropriate Twitter Card tags to create an engaging preview.  If a post does not have a featured image, the module uses the default social image specified in the settings or falls back to the website logo.",
            "version": "1.1.0",
            "name": "socialMedia",
            "priority": 29,
            "dependencies": "[]",
            "settings": "[['key' => 'enable_facebook_og', 'type' => 'boolean', 'default' => True, 'description' => 'Enable Open Graph meta tags for Facebook and other platforms that use Open Graph (e.g., LinkedIn).'], ['key' => 'enable_twitter_cards', 'type' => 'boolean', 'default' => True, 'description' => 'Enable Twitter Card meta tags for enhanced display on Twitter.'], ['key' => 'default_social_image', 'type' => 'string', 'default' => '', 'description' => 'The default image URL to use for social media shares if no featured image is set.  Leave blank to use the website logo.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Links\\BacklinkManager",
            "file": "Links/BacklinkManager.php",
            "title": "Backlink Manager",
            "description": "Tracks and monitors backlinks to your website, analyzing backlink quality, identifying new and lost backlinks, and providing insights into your backlink profile. Helps users improve their link building strategy and understand the impact of backlinks on SEO performance. Integrates with Competitor Analysis to compare backlink profiles.",
            "explain": "The Backlink Manager checks for new and lost backlinks every week (according to the default setting). If new backlinks are discovered, the module analyzes their quality and notifies the administrator.  If existing backlinks are lost, the administrator is also notified, allowing them to investigate the cause and potentially recover the lost link. The module provides a detailed backlink profile report, showing the total number of backlinks, their quality scores, and their anchor text distribution. This information, combined with data from \\'Competitor Analysis,\\' helps users understand their backlink profile\\'s strengths and weaknesses compared to competitors and refine their link building strategy accordingly.",
            "version": "1.0.0",
            "name": "backlinkManager",
            "priority": 23,
            "dependencies": "[]",
            "settings": "[['key' => 'backlink_check_frequency', 'type' => 'string', 'default' => 'weekly', 'description' => 'How often to check for new and lost backlinks: \\'weekly\\', \\'bi-weekly\\', or \\'monthly\\'.'], ['key' => 'notify_on_backlink_changes', 'type' => 'boolean', 'default' => True, 'description' => 'Send email notifications to the administrator when new backlinks are acquired or existing backlinks are lost.'], ['key' => 'analyze_backlink_quality', 'type' => 'boolean', 'default' => True, 'description' => 'Analyze the quality of backlinks based on factors like domain authority, spam score, and relevance. Helps identify high-quality link building opportunities.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Links\\RedirectManager",
            "file": "Links/RedirectManager.php",
            "title": "Redirect Manager",
            "description": "Manages 301 and 302 redirects to prevent broken links, preserve SEO value, and improve user experience. Allows for creating, editing, and importing/exporting redirects. Integrates with the Broken Link Checker for automated redirect suggestions.",
            "explain": "When the \\'Broken Link Checker\\' module identifies a broken link, the Redirect Manager can automatically suggest a suitable redirection target based on content analysis or link history. The user can then review and approve the suggested redirect. The module also allows users to manually create redirects (301 or 302) for specific URLs, import redirects from a CSV file, and export existing redirects for backup or migration.  Using 301 redirects preserves SEO value by passing link equity from the old URL to the new one, preventing 404 errors and improving the user experience. ",
            "version": "1.0.0",
            "name": "redirectManager",
            "priority": 15,
            "dependencies": "[]",
            "settings": "[['key' => 'default_redirect_type', 'type' => 'string', 'default' => '301', 'description' => 'The default redirect type to use: \\'301\\' (permanent) or \\'302\\' (temporary).'], ['key' => 'auto_redirect_broken_links', 'type' => 'boolean', 'default' => False, 'description' => 'Automatically create redirects for broken links detected by the Broken Link Checker, using the most likely destination URL based on content similarity or historical data (if available).']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Links\\BrokenLinkChecker",
            "file": "Links/BrokenLinkChecker.php",
            "title": "Broken Link Checker",
            "description": "Regularly scans the website for broken links (internal and external) and notifies the administrator. Helps maintain site health and improve SEO by identifying and fixing broken links.",
            "explain": "The Broken Link Checker module scans the website every week (as per the default setting).  If it finds more than five broken links based on the configured threshold, it sends an email notification to the site administrator with a list of the broken links.  The administrator can then take action to fix these links, improving site health, user experience, and SEO.",
            "version": "1.0.0",
            "name": "brokenLinkChecker",
            "priority": 14,
            "dependencies": "[]",
            "settings": "[['key' => 'notify_admin', 'type' => 'boolean', 'default' => True, 'description' => 'Send email notifications to the administrator when broken links are detected.'], ['key' => 'check_frequency', 'type' => 'string', 'default' => 'weekly', 'description' => 'How often to check for broken links: \\'daily\\', \\'weekly\\', or \\'monthly\\'.'], ['key' => 'broken_link_threshold', 'type' => 'integer', 'default' => 5, 'description' => 'The minimum number of broken links that must be detected before sending a notification. This helps prevent notification overload for minor issues.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Links\\InternalLinkSuggestions",
            "file": "Links/InternalLinkSuggestions.php",
            "title": "Internal Link Suggestion Tool",
            "description": "Suggests relevant internal links based on content analysis, helping improve website SEO, site structure, and user navigation. Provides suggestions within the content editor and allows for customization of suggestion parameters.",
            "explain": "As a user is writing a blog post about \\'WordPress plugins,\\' the Internal Link Suggestion Tool automatically suggests relevant internal links to other pages on the website, such as a page about \\'SEO plugins\\' or a review of a specific plugin. These suggestions appear within the content editor, making it easy for the user to add internal links with minimal disruption to their workflow. The number of suggestions is limited to the configured maximum (e.g., 3), and suggestions are only provided if the post\\'s word count exceeds the configured minimum.",
            "version": "1.0.0",
            "name": "internalLinkSuggestions",
            "priority": 19,
            "dependencies": "[]",
            "settings": "[['key' => 'automatic_suggestions', 'type' => 'boolean', 'default' => True, 'description' => 'Enable automatic internal link suggestions within the content editor. When enabled, suggestions will appear as you type or edit content.'], ['key' => 'min_word_count', 'type' => 'integer', 'default' => 300, 'description' => 'The minimum word count for a post or page before internal link suggestions are generated.  This helps prevent suggestions for very short content.'], ['key' => 'max_suggestions', 'type' => 'integer', 'default' => 3, 'description' => 'Maximum number of internal link suggestions to display per post/page. Prevents overwhelming users with too many options.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Links\\LinkCounter\\LinkCounter",
            "file": "Links/LinkCounter/LinkCounter.php",
            "title": "Link Counter",
            "description": "Analyzes content to count internal and external links, providing statistics for SEO analysis and content optimization.  Configurable settings determine which types of links are included in the count.",
            "explain": "After a user publishes a blog post, the Link Counter module analyzes the content and counts the number of internal and external links. These counts are then displayed in the post editor or admin dashboard, allowing users to assess their linking strategy and make adjustments for better SEO. For instance, if the module detects a low number of internal links, it might suggest adding more relevant internal links to improve site navigation and distribute link equity.",
            "version": "1.0.0",
            "name": "linkCounter",
            "priority": 30,
            "dependencies": "[]",
            "settings": "[\n\t\t\t\t['key' => 'count_internal_links', 'type' => 'boolean', 'default' => true, 'description' => 'Include internal links (links to other pages within your website) in the total link count.'],\n\t\t\t\t['key' => 'count_external_links', 'type' => 'boolean', 'default' => true, 'description' => 'Include external links (links to websites outside of your domain) in the total link count.'],\n\t\t\t\t['key' => 'count_nofollow_links', 'type' => 'boolean', 'default' => true, 'description' => 'Include links with the \\'nofollow\\' attribute in the count. These links are typically not followed by search engines.'],\n\t\t\t\t['key' => 'count_sponsored_links', 'type' => 'boolean', 'default' => true, 'description' => 'Include links with the \\'sponsored\\' attribute in the count. These links are typically paid or sponsored.']\n\t\t\t]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Performance\\PageSpeed",
            "file": "Performance/PageSpeed.php",
            "title": "Page Speed Optimizer",
            "description": "Analyzes and improves page speed through various optimization techniques, such as image lazy loading, JavaScript/CSS minification, and caching, to enhance SEO performance and user experience.",
            "explain": "With lazy loading enabled, images on a long webpage are only loaded as the user scrolls down, significantly improving the initial page load time.  Minification of JavaScript and CSS files further reduces the overall page size, leading to faster downloads.  Browser caching allows repeat visitors to load the page even faster, as their browsers already have the necessary assets stored locally. These optimizations improve Core Web Vitals and enhance the user experience.",
            "version": "1.0.0",
            "name": "pageSpeed",
            "priority": 7,
            "dependencies": "[]",
            "settings": "[['key' => 'enable_lazy_loading', 'type' => 'boolean', 'default' => True, 'description' => 'Enable lazy loading for images. Images will only be loaded when they are visible in the viewport, improving initial page load time.'], ['key' => 'minify_js_css', 'type' => 'boolean', 'default' => True, 'description' => 'Minify JavaScript and CSS files to reduce their size and improve download speed. This removes unnecessary characters and whitespace.'], ['key' => 'enable_browser_caching', 'type' => 'boolean', 'default' => True, 'description' => 'Enable browser caching to store static assets (images, CSS, JS) locally on the user\\'s browser, reducing the number of requests on subsequent visits.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Performance\\PerformanceOptimizer",
            "file": "Performance/PerformanceOptimizer.php",
            "title": "Website Performance Optimizer",
            "description": "Optimizes website performance by implementing technical best practices, such as browser caching, GZIP compression, HTML/CSS/JS minification, and database optimization. Improves page load speed, Core Web Vitals, and overall SEO performance.",
            "explain": "This module implements several performance optimizations. It enables browser caching so that returning visitors load the website faster.  GZIP compression reduces the size of transferred files, and HTML, CSS, and JS minification further shrinks file sizes. If database optimization is enabled, the module also analyzes and optimizes database queries for improved data retrieval speed. All these optimizations combine to improve page load speed, Core Web Vitals scores (like LCP and FID), and enhance the user experience, indirectly benefiting SEO.",
            "version": "1.0.0",
            "name": "performanceOptimizer",
            "priority": 24,
            "dependencies": "[]",
            "settings": "[['key' => 'enable_browser_caching', 'type' => 'boolean', 'default' => True, 'description' => 'Enable browser caching to store static assets (images, CSS, JS) locally on the user\\'s browser, reducing load times on repeat visits.'], ['key' => 'enable_gzip_compression', 'type' => 'boolean', 'default' => True, 'description' => 'Enable GZIP compression to reduce the size of HTML, CSS, and JavaScript files sent from the server, improving download speeds.'], ['key' => 'minify_html_css_js', 'type' => 'boolean', 'default' => True, 'description' => 'Minify HTML, CSS, and JavaScript files by removing unnecessary characters and whitespace, further reducing file sizes and improving load times.'], ['key' => 'optimize_database_queries', 'type' => 'boolean', 'default' => False, 'description' => 'Optimize database queries to improve data retrieval speed. This can have a significant impact on overall website performance, but requires careful configuration. (See documentation for advanced settings).']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Keywords\\KeywordRankTracker",
            "file": "Keywords/KeywordRankTracker.php",
            "title": "Keyword Rank Tracker",
            "description": "Tracks the ranking performance of specified keywords in major search engines (Google, Bing) over time. Provides reports and visualizations to monitor keyword progress and identify SEO opportunities.",
            "explain": "A user specifies a list of target keywords, such as \\'SEO,\\' \\'WordPress,\\' and \\'content marketing,\\' in the module settings. The Keyword Rank Tracker then checks the ranking positions of these keywords in Google every week (according to the default update frequency). The module generates reports and charts showing the ranking progress of each keyword over time. This allows users to monitor the effectiveness of their SEO efforts and make adjustments to their content strategy to improve keyword rankings.  The module can also provide alerts if rankings drop significantly.",
            "version": "1.0.0",
            "name": "keywordRankTracker",
            "priority": 18,
            "dependencies": "[]",
            "settings": "[['key' => 'target_keywords', 'type' => 'array', 'default' => [], 'description' => 'A list of target keywords to track (e.g., [\\'SEO\\', \\'WordPress\\', \\'content marketing\\']).  These keywords should align with your website\\'s content and target audience. Separate keywords with commas.'], ['key' => 'update_frequency', 'type' => 'string', 'default' => 'weekly', 'description' => 'How often to check and update keyword rankings: \\'daily\\', \\'weekly\\', or \\'monthly\\'.'], ['key' => 'search_engine', 'type' => 'string', 'default' => 'google', 'description' => 'The primary search engine to track keyword rankings in: \\'google\\', \\'bing\\', or \\'both\\'.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Keywords\\KeywordResearchTool",
            "file": "Keywords/KeywordResearchTool.php",
            "title": "Keyword Research Tool",
            "description": "Discover new keyword opportunities with integrated keyword research functionality. Analyze search volume, competition, and related keywords to optimize your content strategy.",
            "explain": "The Keyword Research Tool helps you discover new keyword opportunities. Enter a seed keyword (e.g., \"SEO\"), and the module will provide a list of related keywords with search volume, competition data, and other relevant metrics. You can filter and sort the results to identify the best keywords to target in your content.",
            "version": "1.0.0",
            "name": "keywordResearchTool",
            "priority": 10,
            "dependencies": "[]",
            "settings": "[['key' => 'preferred_search_engine', 'type' => 'string', 'default' => 'google', 'description' => 'Select your preferred search engine for keyword research (e.g., \"google\", \"bing\").'], ['key' => 'country_code', 'type' => 'string', 'default' => 'us', 'description' => 'Specify the target country code for localized keyword research (e.g., \"us\", \"uk\", \"de\").'], ['key' => 'language_code', 'type' => 'string', 'default' => 'en', 'description' => 'Specify the target language code for keyword research (e.g., \"en\", \"es\", \"fr\").']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Keywords\\SERPFeatureTracking",
            "file": "Keywords/SERPFeatureTracking.php",
            "title": "SERP Feature Tracking",
            "description": "Track your website\\'s performance in SERP features (featured snippets, knowledge panels, etc.) to optimize your content and improve search visibility.",
            "explain": "This module tracks which SERP features your website appears in for your target keywords.  It provides data on featured snippet appearances, knowledge panel listings, and other SERP features, helping you understand how your content is being displayed in search results and identify opportunities to optimize for specific features.",
            "version": "1.0.0",
            "name": "serpFeatureTracking",
            "priority": 12,
            "dependencies": "[]",
            "settings": "[['key' => 'target_keywords', 'type' => 'array', 'default' => [], 'description' => 'Enter an array of target keywords to track for SERP features (e.g., [\\'SEO\\', \\'WordPress\\']).'], ['key' => 'target_search_engine', 'type' => 'string', 'default' => 'google', 'description' => 'Select the target search engine for SERP feature tracking (e.g., \"google\", \"bing\").']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Technical\\Sitemap",
            "file": "Technical/Sitemap.php",
            "title": "XML Sitemap Generator",
            "description": "Generates and submits XML sitemaps to search engines (Google, Bing, etc.) to improve indexation and SEO visibility.  Includes options for customizing sitemap content and update frequency.",
            "explain": "This module automatically generates an XML sitemap that includes all posts, pages, and images (based on the default settings). It then submits this sitemap to major search engines like Google and Bing, helping them discover and index new content more efficiently. The sitemap is regenerated weekly according to the default frequency. Users can customize the included post types and update frequency through the module settings.",
            "version": "1.0.0",
            "name": "sitemap",
            "priority": 8,
            "dependencies": "[]",
            "settings": "[['key' => 'include_images', 'type' => 'boolean', 'default' => true, 'description' => 'Include images in the sitemap to improve image search visibility.'], ['key' => 'frequency', 'type' => 'string', 'default' => 'weekly', 'description' => 'How often the sitemap is regenerated: \\'daily\\', \\'weekly\\', \\'monthly\\', or \\'yearly\\'.'], ['key' => 'include_post_types', 'type' => 'array', 'default' => ['post', 'page'], 'description' => 'An array of WordPress post types to include in the sitemap (e.g., [\\'post\\', \\'page\\', \\'product\\']).']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Technical\\MobileSEOAnalyser",
            "file": "Technical/MobileSEOAnalyser.php",
            "title": "Mobile SEO Analyzer",
            "description": "Comprehensive mobile SEO analysis and optimization toolkit that ensures your website meets mobile-first indexing requirements, optimizes mobile user experience, and improves mobile search rankings.",
            "explain": "The Mobile SEO Analyzer module continuously monitors your website\\'s mobile optimization status. It checks viewport configurations, analyzes touch element spacing, monitors mobile page speed, and validates mobile-friendly implementation. When issues are detected, it provides specific recommendations for improvement. For example, if touch elements are too close together, it will suggest specific spacing adjustments. The module also integrates with Core Web Vitals monitoring to ensure mobile performance meets Google\\'s standards.",
            "version": "1.0.0",
            "name": "mobileSeoAnalyzer",
            "priority": 6,
            "dependencies": "[]",
            "settings": "[['key' => 'mobile_viewport_check', 'type' => 'boolean', 'default' => true, 'description' => 'Automatically check and validate mobile viewport configurations and responsive design elements.'], ['key' => 'touch_element_spacing', 'type' => 'boolean', 'default' => true, 'description' => 'Analyze and optimize touch element spacing for better mobile usability.'], ['key' => 'mobile_speed_monitoring', 'type' => 'boolean', 'default' => true, 'description' => 'Monitor and optimize mobile page load speeds and performance metrics.'], ['key' => 'amp_compatibility_check', 'type' => 'boolean', 'default' => false, 'description' => 'Check and validate AMP implementation if enabled.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Technical\\VoiceSearchOptimization",
            "file": "Technical/VoiceSearchOptimization.php",
            "title": "Voice Search Optimization",
            "description": "Optimizes website content and structure for voice search by focusing on long-tail keywords, conversational language, FAQ schema markup, and mobile-friendliness. Improves visibility in voice search results and enhances user experience for voice search queries.",
            "explain": "When enabled, the module suggests using the FAQPage schema for content containing frequently asked questions. This helps search engines understand the question-and-answer format and increases the chances of appearing as a rich snippet or voice search answer. If a user is writing about \\'best pizza in Chicago\\', the module suggests long-tail, conversational keywords like \\'Where can I find good pizza near me in Chicago?\\' or \\'What are the top-rated pizza places in downtown Chicago?\\'.  It will also check for mobile-friendliness and remind users to optimize the website for mobile devices, which are predominantly used for voice search.",
            "version": "1.0.0",
            "name": "voiceSearchOptimization",
            "priority": 25,
            "dependencies": "[]",
            "settings": "[['key' => 'enable_faq_schema', 'type' => 'boolean', 'default' => True, 'description' => 'Enable FAQPage schema markup to provide structured data for frequently asked questions, improving visibility in voice search results and rich snippets.'], ['key' => 'conversational_keyword_suggestions', 'type' => 'boolean', 'default' => True, 'description' => 'Provide suggestions for conversational and long-tail keywords within the content editor, helping users optimize content for voice search queries.'], ['key' => 'mobile_optimization_check', 'type' => 'boolean', 'default' => True, 'description' => 'Perform checks for mobile-friendliness, a crucial factor for voice search optimization, as most voice searches are performed on mobile devices.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Technical\\MetaTags\\MetaTags",
            "file": "Technical/MetaTags/MetaTags.php",
            "title": "Meta Tags Manager",
            "description": "Manages and optimizes meta tags (title, description, keywords, Open Graph, etc.) for individual pages and posts to improve SEO and social media sharing. Provides default values and allows for customization.",
            "explain": "If a user creates a new blog post and does not enter a meta description, this module automatically uses the configured default description (\\'Welcome to our site!\\').  If the user specifies keywords, those are used; otherwise, the default keywords are used. The module also generates Open Graph tags for social media sharing, using the featured image as the OG image based on the configured settings.  This ensures that every page has optimized meta information for both search engines and social platforms.",
            "version": "1.1.0",
            "name": "metaTags",
            "priority": 5,
            "dependencies": "[]",
            "settings": "[['key' => 'default_description', 'type' => 'string', 'default' => 'Welcome to our site!', 'description' => 'The default meta description used for pages and posts that do not have a custom description set.  This description should be concise and enticing.'], ['key' => 'default_keywords', 'type' => 'string', 'default' => 'WordPress, SEO, blog', 'description' => 'Default meta keywords. While less impactful than descriptions, these can still provide context to search engines.'], ['key' => 'og_image_source', 'type' => 'string', 'default' => 'featured_image', 'description' => 'Source for the Open Graph image: \\'featured_image\\', \\'custom_url\\', or \\'none\\'.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Analytics\\UserEngagementMetrics",
            "file": "Analytics/UserEngagementMetrics.php",
            "title": "User Engagement Metrics Tracker",
            "description": "Tracks and analyzes user engagement metrics, such as time on page, scroll depth, bounce rate, and conversion rates, to assess content effectiveness and identify areas for improvement. Integrates with Advanced SEO Analytics for a comprehensive view of user behavior.",
            "explain": "This module tracks how long users spend on each page and how far they scroll.  It also monitors the bounce rate to identify pages that need improvement.  By defining a conversion goal, such as a form submission, the module can track the conversion rate of different pages and identify high-performing content. This data, combined with insights from \\'Advanced SEO Analytics\\', provides a complete understanding of user behavior and helps content creators optimize their content for maximum engagement and conversions.  For example, if users are consistently bouncing from a particular page, the module might suggest improving the page\\'s readability, adding clearer calls to action, or redesigning the layout.",
            "version": "1.0.0",
            "name": "userEngagementMetrics",
            "priority": 27,
            "dependencies": "[]",
            "settings": "[['key' => 'track_time_on_page', 'type' => 'boolean', 'default' => True, 'description' => 'Track the average time users spend on each page, providing insights into content engagement and readability.'], ['key' => 'track_scroll_depth', 'type' => 'boolean', 'default' => True, 'description' => 'Track how far users scroll down each page, helping identify content drop-off points and optimize content length and structure.'], ['key' => 'track_bounce_rate', 'type' => 'boolean', 'default' => True, 'description' => 'Track the bounce rate (percentage of users who leave after viewing only one page) to identify pages with poor user engagement or unclear calls to action.'], ['key' => 'conversion_goal', 'type' => 'string', 'default' => '', 'description' => 'Define a conversion goal, such as form submissions, product purchases, or newsletter sign-ups. This allows the module to track conversion rates and assess the effectiveness of your content in driving desired actions. (See documentation for setting up conversion goals).']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Analytics\\AdvancedAnalytics",
            "file": "Analytics/AdvancedAnalytics.php",
            "title": "Advanced SEO Analytics",
            "description": "Integrates with Google Analytics and other analytics platforms to provide in-depth SEO performance data, including organic traffic, bounce rate, user behavior, conversion tracking, and other key metrics. Helps users understand how SEO efforts impact website performance.",
            "explain": "After a user connects their Google Analytics account by entering their tracking ID, this module pulls in data about organic traffic, bounce rate, time on page, and other key metrics.  If enhanced ecommerce tracking is enabled, and the user is running WooCommerce, the module also collects detailed ecommerce data, such as product views and purchases.  This information is displayed in reports and dashboards within the SEO plugin, providing a comprehensive view of SEO performance and its impact on user behavior and conversions. The \\'track user behavior events\\' setting allows collecting more granular data on specific user interactions, such as how far users scroll down a page or which links they click.",
            "version": "1.0.0",
            "name": "advancedAnalytics",
            "priority": 22,
            "dependencies": "[]",
            "settings": "[['key' => 'google_analytics_id', 'type' => 'string', 'default' => '', 'description' => 'Your Google Analytics tracking ID (e.g., UA-XXXXXXXX-X). Enter this ID to enable integration with Google Analytics.'], ['key' => 'track_user_behavior_events', 'type' => 'boolean', 'default' => True, 'description' => 'Track specific user interactions and behavior events, such as scroll depth, link clicks, and form submissions.  Provides more granular data on user engagement.'], ['key' => 'enhanced_ecommerce_tracking', 'type' => 'boolean', 'default' => False, 'description' => 'Enable enhanced ecommerce tracking in Google Analytics to collect detailed data about product views, add-to-carts, purchases, and other ecommerce activities. Requires ecommerce functionality on your website.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Analytics\\CoreWebVitalsMonitor",
            "file": "Analytics/CoreWebVitalsMonitor.php",
            "title": "Core Web Vitals Monitor",
            "description": "Real-time monitoring and optimization system for Core Web Vitals metrics (LCP, FID, CLS), providing actionable insights and automatic optimization suggestions to improve search ranking signals.",
            "explain": "The Core Web Vitals Monitor tracks LCP (Largest Contentful Paint), FID (First Input Delay), and CLS (Cumulative Layout Shift) in real-time. It integrates with the Performance Optimizer module to provide specific optimization recommendations. For example, if LCP is high, it might suggest image optimization or server response time improvements. The module also maintains a historical record of metrics to track improvements over time and correlate with SEO performance.",
            "version": "1.0.0",
            "name": "coreWebVitalsMonitor",
            "priority": 4,
            "dependencies": "[]",
            "settings": "[['key' => 'real_time_monitoring', 'type' => 'boolean', 'default' => true, 'description' => 'Enable real-time monitoring of Core Web Vitals metrics.'], ['key' => 'performance_alerts', 'type' => 'boolean', 'default' => true, 'description' => 'Send alerts when Core Web Vitals metrics fall below acceptable thresholds.'], ['key' => 'automatic_optimization', 'type' => 'boolean', 'default' => false, 'description' => 'Automatically apply recommended optimizations when possible.'], ['key' => 'field_data_analysis', 'type' => 'boolean', 'default' => true, 'description' => 'Analyze real user metrics data for Core Web Vitals performance.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Store\\EcommerceSEOOptimizer",
            "file": "Store/EcommerceSEOOptimizer.php",
            "title": "E-commerce SEO Optimizer",
            "description": "Specialized SEO optimization suite for e-commerce websites, focusing on product pages, category optimization, and shopping feed management to improve visibility in product searches.",
            "explain": "The E-commerce SEO Optimizer automatically enhances product pages with optimized schema markup, including price, availability, and review information. It structures category pages for optimal crawling and indexing, while ensuring proper internal linking between related products. When a new product is added or updated, the module automatically generates optimized meta descriptions, titles, and product schema. It also monitors product performance in search results and provides recommendations for improvement based on competitor analysis and search trends.",
            "version": "1.0.0",
            "name": "ecommerceSeoOptimizer",
            "priority": 5,
            "dependencies": "[]",
            "settings": "[['key' => 'product_schema_automation', 'type' => 'boolean', 'default' => true, 'description' => 'Automatically generate and optimize product schema markup for all products.'], ['key' => 'category_page_optimization', 'type' => 'boolean', 'default' => true, 'description' => 'Optimize category pages with appropriate meta data and internal linking structure.'], ['key' => 'review_markup_integration', 'type' => 'boolean', 'default' => true, 'description' => 'Integrate product reviews into schema markup for rich snippets.'], ['key' => 'shopping_feed_optimization', 'type' => 'boolean', 'default' => false, 'description' => 'Optimize product feeds for Google Shopping and other shopping platforms.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Media\\VideoSEO",
            "file": "Media/VideoSEO.php",
            "title": "Video SEO Optimizer",
            "description": "Enhances video content visibility in search results by generating video sitemaps, adding VideoObject schema markup, and optimizing video metadata (titles, descriptions, tags). Helps improve video rankings and drive more traffic from video search.",
            "explain": "If a user embeds a video on their website, this module automatically generates a VideoObject schema markup using the data from the settings and including information like the video title, description, thumbnail URL, and duration. The module also creates a dedicated video sitemap, making it easier for search engines to index the video content. If \\'autogenerate_video_metadata\\' is enabled and connected to a supported service, the module can analyze the video content and automatically suggest optimized titles, descriptions, and tags, saving users time and improving video SEO.",
            "version": "1.0.0",
            "name": "videoSeo",
            "priority": 26,
            "dependencies": "[]",
            "settings": "[['key' => 'generate_video_sitemap', 'type' => 'boolean', 'default' => True, 'description' => 'Generate a separate sitemap specifically for video content, improving the discoverability of videos by search engines.'], ['key' => 'enable_video_schema', 'type' => 'boolean', 'default' => True, 'description' => 'Add VideoObject schema markup to video pages, providing search engines with detailed information about your videos, such as title, description, thumbnail, and duration. This can enhance visibility in video search results and rich snippets.'], ['key' => 'autogenerate_video_metadata', 'type' => 'boolean', 'default' => False, 'description' => 'Automatically generate optimized video metadata (title, description, tags) based on video content analysis.  Requires integration with a video hosting/processing service.']]"
        },
        {
            "class": "RankingCoach\\Inc\\Modules\\ModuleLibrary\\Media\\ImageOptimizer",
            "file": "Media/ImageOptimizer.php",
            "title": "Image Optimizer",
            "description": "Optimizes images upon upload or manually to reduce file sizes, improve page load speed, and enhance SEO.  Uses various optimization techniques configurable through settings.",
            "explain": "When an image is uploaded, this module automatically reduces its file size using the configured compression level and optimization method (e.g., lossy or lossless). This results in faster page load times and improved SEO performance without significant visual impact. Users can also manually optimize existing images in the media library.",
            "version": "1.0.0",
            "name": "imageOptimizer",
            "priority": 2,
            "dependencies": "[]",
            "settings": "[['key' => 'optimize_on_upload', 'type' => 'boolean', 'default' => true, 'description' => 'Automatically optimize images when they are uploaded to the media library.'], ['key' => 'compression_level', 'type' => 'integer', 'default' => 75, 'description' => 'Sets the compression level for image optimization (0-100, where 100 is the least compression).'], ['key' => 'optimization_method', 'type' => 'string', 'default' => 'lossy', 'description' => 'Choose the image optimization method: \\'lossy\\' for smaller file sizes (some quality loss) or \\'lossless\\' for preserving image quality.']]"
        }
    ]
}